OpenDTEF-v1812/tutorials/combustion/fireFoam/LES/compartmentFire/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 101325;
    }
    entrainment
    {
        type            calculated;
        value           uniform 101325;
    }
    outlet
    {
        type            calculated;
        value           uniform 101325;
    }
    region0_to_panelRegion_wallPanel
    {
        type            calculated;
        value           uniform 101325;
    }
    region0_to_panelRegion_internalWallPanel_top
    {
        type            calculated;
        value           uniform 101325;
    }
    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            calculated;
        value           uniform 101325;
    }
}


// ************************************************************************* //
